In [1]:
import pandas as pd
import numpy as np

In [11]:
df_dict = {'Country': ['Ghana', 'Kenya', 'Nigeria', 'Togo'],
          'Capital': ['Accra', 'Nairobi', 'Abuja', 'Lome'],
          'Population': [10000, 8500, 35000, 12000],
          'Age': [60, 70, 80, 75]}
df = pd.DataFrame(df_dict, index = [2, 4, 6, 8])
print(df)

df_list = [
    ['Ghana', 'Accra', 10000, 60],
    ['Kenya', 'Nairobi', 8500, 70],
    ['Nigeria', 'Abuja', 35000, 80],
    ['Togo', 'Lome', 12000, 75]
]
df1 = pd.DataFrame(df_list, index = [2, 4, 6, 8], columns = ['Country', 'Capital', 'Population', 'Age'])
print('\n')
print(df1)

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75


   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [17]:
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

In [25]:
df.loc[6]

Country       Nigeria
Capital         Abuja
Population      35000
Age                80
Name: 6, dtype: object

In [37]:
new_df = df.copy()

In [49]:
df.isnull().dropna()

   Country  Capital  Population    Age
2    False    False       False  False
4    False    False       False  False
6    False    False       False  False
8    False    False       False  False

In [47]:
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75